In [1]:
import numpy as np

import pandas as pd

In [2]:
df = pd.DataFrame({"id":[1,2,3,4,5,6],

"date":pd.date_range('20130102', periods=6),

"city":['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],

"age":[23,44,54,32,34,32],

"category":['100-A','100-B','110-A','110-C','210-A','130-F'],

"price":[1200,np.nan,2133,5433,np.nan,4432]},

columns =['id','date','city','category','age','price'])

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        6 non-null      int64
 1   date      6 non-null      datetime64[ns]
 2   city      6 non-null      object
 3   category  6 non-null      object
 4   age       6 non-null      int64
 5   price     4 non-null      float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 416.0+ bytes

In [4]:
df

   id       date         city category  age   price
0   1 2013-01-02     Beijing     100-A   23  1200.0
1   2 2013-01-03           SH    100-B   44     NaN
2   3 2013-01-04   guangzhou     110-A   54  2133.0
3   4 2013-01-05     Shenzhen    110-C   32  5433.0
4   5 2013-01-06     shanghai    210-A   34     NaN
5   6 2013-01-07     BEIJING     130-F   32  4432.0

In [5]:
df1=pd.DataFrame({"id":[1,2,3,4,5,6,7,8],

"gender":['male','female','male','female','male','female','male','female'],

"pay":['Y','N','Y','Y','N','Y','N','Y',],

"m-point":[10,12,20,40,40,40,30,20]})

In [6]:
df_inner=pd.merge(df,df1,how='inner') # 匹配合并，交集

df_left=pd.merge(df,df1,how='left') #

df_right=pd.merge(df,df1,how='right')

df_outer=pd.merge(df,df1,how='outer') #并集

In [7]:
df_inner

   id       date         city category  age   price  gender pay  m-point
0   1 2013-01-02     Beijing     100-A   23  1200.0    male   Y       10
1   2 2013-01-03           SH    100-B   44     NaN  female   N       12
2   3 2013-01-04   guangzhou     110-A   54  2133.0    male   Y       20
3   4 2013-01-05     Shenzhen    110-C   32  5433.0  female   Y       40
4   5 2013-01-06     shanghai    210-A   34     NaN    male   N       40
5   6 2013-01-07     BEIJING     130-F   32  4432.0  female   Y       40

In [9]:
df_inner['price'].corr(df_inner['m-point']) #相关系数在-1到1之间，接近1为正相关，接近-1为负相关，0为不相关

0.9753247017958027